# Feature encoding

`Feature encoding` mai categorical data ko numerical data mai convert karna hota hai. Categorical data ko numerical data mai convert karne ke liye different techniques use ki jati hain jese `Label Encoding`, `One Hot Encoding`, `Target Encoding` etc.

# why we need feature encoding?

Machine learning models only understand numerical data. Categorical data ko numerical data mai convert karne ke liye feature encoding ki zarurat hoti hai. or computer numerical data ko samajh sakta hai.

1. mostly ML ke algorithms categorical data ko support nahi karte hain. is liye categorical data ko numerical data mai convert karna zaruri hota hai.
2. efficient computation: numerical data ko process karna easy hota hai as compare to categorical data.

3. Feature representation: numerical data ko visualize karna easy hota hai as compare to categorical data.

4. Support unseen categories: agar model ko unseen categories se face karna hota hai to model categorical data ko numerical data mai convert karne se is problem se bach sakta hai.

In [38]:
# Import libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

# load dataset

data = sns.load_dataset('tips')
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [39]:
data['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

---
 # Types of Feature Encoding



# 1. Label Encoding

`Label Encoding` mai categorical data ko numerical data mai convert karte hain. Is technique mai har unique category ko unique number assign kiya jata hai. For example agar humare pass 3 unique categories hain jese `A`, `B` and `C` to hum in categories ko 1, 2 and 3 assign kar sakte hain.

In [41]:
# label encoder


from sklearn.preprocessing import LabelEncoder, OneHotEncoder, OrdinalEncoder

le=LabelEncoder()

data['day']=le.fit_transform(data['day'])
data=data['day']
data.head()

0    2
1    2
2    2
3    2
4    2
Name: day, dtype: int64


# 2. One Hot Encoding

`One Hot Encoding` mai categorical data ko binary form mai convert kiya jata hai. Is technique mai har unique category ko ek new column mai convert kiya jata hai. For example agar humare pass 3 unique categories hain jese `A`, `B` and `C` to hum in categories ko 3 new columns mai convert kar sakte hain. Agar koi row `A` category mai belong karta hai to us row ke `A` column mai 1 assign kiya jata hai aur `B` and `C` column mai 0 assign kiya jata hai.

In [ ]:
from sklearn.preprocessing import OneHotEncoder

data = sns.load_dataset('tips')
Ohencoder = OneHotEncoder()
Ohencoder.fit_transform(data[['day']]).toarray()

# data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [61]:
data['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [66]:
# example 2 one hot encoding

data = sns.load_dataset('titanic')
Ohencoder = OneHotEncoder()
embarked_encoder = Ohencoder.fit_transform(data[['embarked']]).toarray()
embarked_encoder_data = pd.DataFrame(embarked_encoder, columns=Ohencoder.get_feature_names_out(['embarked']))
data = pd.concat([data.reset_index(drop=True), embarked_encoder_data.reset_index(drop=True)], axis=1)
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,embarked_C,embarked_Q,embarked_S,embarked_nan
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,0.0,0.0,1.0,0.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1.0,0.0,0.0,0.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0.0,0.0,1.0,0.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0.0,0.0,1.0,0.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,0.0,0.0,1.0,0.0


# 3. Ordinal Encoding

`Ordinal Encoding` mai categorical data ko numerical data mai convert kiya jata hai. Is technique mai categories ko order mai convert kiya jata hai. For example agar humare pass 3 unique categories hain jese `A`, `B` and `C` to hum in categories ko 1, 2 and 3 assign kar sakte hain. Is technique mai categories ko order mai convert kiya jata hai jese `A` ko 1, `B` ko 2 and `C` ko 3 assign kiya jata hai.

In [45]:
# Ensure data is a DataFrame and contains the 'day' column
data = sns.load_dataset('tips')
# data['day'] = le.fit_transform(data['day'])
data['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [82]:
# Ordinal encoding the day column using specific order

from sklearn.preprocessing import OrdinalEncoder
import pandas as pd

data = sns.load_dataset('tips')

oe = OrdinalEncoder(categories=[['Thur', 'Fri', 'Sat', 'Sun']])
data['encoded_day'] = oe.fit_transform(data[['day']])

data.head()

   total_bill   tip     sex smoker  day    time  size  encoded_day
0       16.99  1.01  Female     No  Sun  Dinner     2          3.0
1       10.34  1.66    Male     No  Sun  Dinner     3          3.0
2       21.01  3.50    Male     No  Sun  Dinner     3          3.0
3       23.68  3.31    Male     No  Sun  Dinner     2          3.0
4       24.59  3.61  Female     No  Sun  Dinner     4          3.0

In [83]:
data['encoded_day'].value_counts()

encoded_day
2.0    87
3.0    76
0.0    62
1.0    19
Name: count, dtype: int64


# 4. Binary Encoding

`Binary Encoding` mai categorical data ko binary form mai convert kiya jata hai. Is technique mai categories ko binary form mai convert kiya jata hai. For example agar humare pass 3 unique categories hain jese `A`, `B` and `C` to hum in categories ko binary form mai convert kar sakte hain. Is technique mai categories ko binary form mai convert kiya jata hai jese `A` ko 001, `B` ko 010 and `C` ko 100 assign kiya jata hai.

In [ ]:
# !pip install category_encoders need before code for binary ecoding

In [80]:
import pandas as pd

# define input data
data = pd.DataFrame({'day': ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat']})
print("Original data:\n", data)

# create a binary encoding
binary_encoded = data['day'].apply(lambda x: format(ord(x[0]), '08b'))
print("Binary encoded data:\n", binary_encoded)

Original data:
    day
0  Sun
1  Mon
2  Tue
3  Wed
4  Thu
5  Fri
6  Sat
Binary encoded data:
 0    01010011
1    01001101
2    01010100
3    01010111
4    01010100
5    01000110
6    01010011
Name: day, dtype: object

In [74]:
df=sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4


# 5. Frequency on count Encoding

`Frequency on count Encoding` mai categorical data ko numerical data mai convert kiya jata hai. Is technique mai categories ko unki frequency ke hisab se convert kiya jata hai. For example agar humare pass 3 unique categories hain jese `A`, `B` and `C` to hum in categories ko unki frequency ke hisab se convert kar sakte hain. Is technique mai categories ko unki frequency ke hisab se convert kiya jata hai jese `A` ko 1, `B` ko 2 and `C` ko 3 assign kiya jata hai.

In [ ]:
import pandas as pd

# define input data
data = pd.Series(['red', 'green', 'blue', 'green', 'blue', 'blue'])
print("Original data:\n", data)

# create a frequency encoding
frequency_encoded = data.map(data.value_counts())
print("Frequency encoded data:\n", frequency_encoded)

---
# Feature encoding using pandas

`pandas` mai different methods hain jin se hum feature encoding kar sakte hain. Jese `get_dummies()`, `factorize()`, `map()` etc.

`get_dummies()`: sy ap kisi bhi column ko true or false ki from mai btaega jese agar ap kisi column ko get_dummies() mai pass karte hain to wo column true or false ki form mai convert ho jata hai.

`factorize()`: sy ap kisi bhi column ko numerical form mai convert kar sakte hain.

`map()`: sy ap kisi bhi column ko map kar sakte hain.

In [5]:
import seaborn as sns
import pandas as pd
data=sns.load_dataset('tips')
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [8]:
# get_dummies()
pd.get_dummies(data['day'])

      Thur    Fri    Sat    Sun
0    False  False  False   True
1    False  False  False   True
2    False  False  False   True
3    False  False  False   True
4    False  False  False   True
..     ...    ...    ...    ...
239  False  False   True  False
240  False  False   True  False
241  False  False   True  False
242  False  False   True  False
243   True  False  False  False

[244 rows x 4 columns]

In [9]:
get_dummies = pd.get_dummies(data,columns=['day'])
get_dummies.head()

,total_bill,tip,sex,smoker,time,size,day_Thur,day_Fri,day_Sat,day_Sun
0,16.99,1.01,Female,No,Dinner,2,False,False,False,True
1,10.34,1.66,Male,No,Dinner,3,False,False,False,True
2,21.01,3.50,Male,No,Dinner,3,False,False,False,True
3,23.68,3.31,Male,No,Dinner,2,False,False,False,True
4,24.59,3.61,Female,No,Dinner,4,False,False,False,True

In [10]:
# factorize() method

data = sns.load_dataset('tips')
data['day'].factorize()

(array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 0, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        3, 3, 3, 3, 3, 3, 3, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 2], dtype=int64),
 CategoricalIndex(['Sun', 'Sat', 'Thur', 'Fri'], categories=['Thur', 'Fri', 'Sat', 'Sun'], ordered=False, dtype='category'))